Repository: NguyenTuanAnh-Hara/2025_LTTBDD_N02_Nhom_10
Catalog: lTMOBILE/cooking_recipe_app/lib/l10n/app_*.arb
Languages: vi

# navHome
source: Home
vi: Trang chủ

# navAbout
source: About
vi: Giới thiệu

# homeWelcome
source: Welcome!
vi: Chào mừng!

# homeSearchHint
source: Search recipes...
vi: Tìm kiếm công thức...

# homeCategoryFood
source: Food
vi: Món ăn

# homeCategoryDrink
source: Drink
vi: Đồ uống

# homeMinutes
source: min
vi: phút

# detailIngredients
source: Ingredients
vi: Nguyên liệu

# detailSteps
source: Steps
vi: Các bước thực hiện

# aboutTitle
source: About Us
vi: Thông tin nhóm

# aboutCourse
source: Course
vi: Môn học

# aboutCourseName
source: Mobile Programming
vi: Lập trình cho thiết bị di động

# aboutProject
source: Project
vi: Đề tài

# aboutProjectName
source: Recipe App
vi: Ứng dụng Công thức Nấu ăn

# aboutTeacher
source: Instructor
vi: GVHD

# aboutTeacherName
source: Que Nguyen Xuan
vi: Nguyễn Xuân Quế

# aboutStudent
source: Student
vi: Sinh viên

# aboutStudentName
source: Nguyen Tuan Anh - 23010575
vi: Nguyễn Tuấn Anh - 23010575

# aboutLanguage
source: Language
vi: Ngôn ngữ

# aboutLangVI
source: Vietnamese (VI)
vi: Tiếng Việt (VI)

# r1_ing_2
source: Eggs (2)
vi: Trứng gà (2 quả)

# r1_ing_3
source: Pecorino cheese (50g)
vi: Phô mai Pecorino (50g)

# r1_ing_4
source: Smoked bacon (100g)
vi: Thịt ba rọi xông khói (100g)

# r1_ing_5
source: Black pepper
vi: Tiêu đen

# r1_step_1
source: Boil spaghetti for 8-10 minutes.
vi: Luộc mì Spaghetti 8-10 phút.

# r1_step_2
source: Dice bacon, fry until crispy.
vi: Cắt thịt ba rọi thành hạt lựu, xào cho đến khi giòn.

# r1_step_3
source: Whisk eggs with grated cheese and pepper.
vi: Đánh tan trứng với phô mai bào nhỏ và tiêu.

# r1_step_4
source: Add cooked pasta (reserve some pasta water) to the pan with bacon. Turn off heat.
vi: Vớt mì đã luộc (giữ lại chút nước) cho vào chảo thịt. Tắt bếp.

# r1_step_5
source: Pour in the egg and cheese mixture, stirring quickly. The residual heat will cook the eggs.
vi: Đổ hỗn hợp trứng phô mai vào, đảo nhanh tay. Hơi nóng của mì sẽ làm chín trứng.

# r1_step_6
source: Add a little pasta water if it's too dry. Add more pepper and serve.
vi: Thêm chút nước luộc mì nếu quá khô. Thêm tiêu và thưởng thức.

# r2_name
source: Hanoi Pho Bo (Beef Noodle Soup)
vi: Phở Bò Hà Nội

# r2_ing_1
source: Pho noodles (500g)
vi: Bánh phở (500g)

# r2_ing_2
source: Beef (sirloin, flank) (300g)
vi: Thịt bò (thăn, nạm) (300g)

# r2_ing_3
source: Beef bones (1kg)
vi: Xương ống bò (1kg)

# r2_ing_4
source: Onion (1)
vi: Hành tây (1 củ)

# r2_ing_5
source: Ginger (1 branch)
vi: Gừng (1 nhánh)

# r2_ing_6
source: Cardamom, star anise, cinnamon
vi: Thảo quả, hoa hồi, quế

# r2_ing_7
source: Spring onions, cilantro, lime, chili
vi: Hành lá, ngò rí, chanh, ớt

# r2_step_1
source: Clean bones, blanch in boiling water. Simmer bones with grilled ginger, onion, and spices for 4-6 hours.
vi: Rửa sạch xương ống, chần qua nước sôi. Ninh xương với gừng, hành nướng và gia vị thảo mộc trong 4-6 giờ.

# r2_step_2
source: Filter for a clear broth.
vi: Lọc lấy nước dùng trong.

# r2_step_3
source: Slice the beef thinly.
vi: Thái mỏng thịt bò.

# r2_step_4
source: Blanch pho noodles in boiling water.
vi: Trần bánh phở qua nước sôi.

# r2_step_5
source: Place noodles and beef in a bowl, pour boiling broth over.
vi: Cho phở, thịt bò vào tô, chan nước dùng đang sôi.

# r2_step_6
source: Add spring onions, cilantro, and serve with lime and chili.
vi: Thêm hành lá, ngò rí và thưởng thức cùng chanh, ớt.

# r3_name
source: Garlic Bread
vi: Bánh mì nướng Bơ Tỏi

# r3_ing_1
source: Baguette (1 loaf)
vi: Bánh mì baguette (1 ổ)

# r3_ing_2
source: Unsalted butter (100g)
vi: Bơ lạt (100g)

# r3_ing_3
source: Garlic (3 cloves)
vi: Tỏi (3 tép)

# r3_ing_4
source: Parsley (1 handful)
vi: Ngò rí (1 nhúm)

# r3_ing_5
source: Salt (1/4 tsp)
vi: Muối (1/4 muỗng cà phê)

# r3_step_1
source: Slice the baguette diagonally 1.5cm thick.
vi: Cắt bánh mì thành lát xéo dày 1.5cm.

# r3_step_2
source: Mince garlic and parsley.
vi: Băm nhuyễn tỏi và ngò rí.

# r3_step_3
source: Soften butter at room temperature. Mix butter with garlic, parsley, and salt.
vi: Để bơ mềm ở nhiệt độ phòng. Trộn bơ với tỏi, ngò rí và muối.

# r3_step_4
source: Spread the garlic butter mixture evenly on both sides of the bread.
vi: Phết hỗn hợp bơ tỏi lên đều hai mặt bánh mì.

# r3_step_5
source: Bake at 180°C (350°F) for 10-12 minutes until golden brown.
vi: Nướng ở 180°C trong 10-12 phút cho đến khi vàng giòn.

# r4_name
source: Bun Cha Hanoi (Grilled Pork with Noodles)
vi: Bún Chả Hà Nội

# r4_ing_1
source: Vermicelli noodles (1kg)
vi: Bún rối (1kg)

# r4_ing_2
source: Pork belly (500g)
vi: Thịt ba rọi (500g)

# r4_ing_3
source: Pork shoulder (500g)
vi: Thịt nạc vai (500g)

# r4_ing_4
source: Kohlrabi, carrot, green papaya
vi: Su hào, cà rốt, đu đủ xanh

# r4_ing_5
source: Fish sauce, sugar, garlic, chili
vi: Nước mắm, đường, tỏi, ớt

# r4_ing_6
source: Fresh herbs (lettuce, perilla, etc.)
vi: Rau sống ăn kèm

# r4_step_1
source: Slice pork belly. Mince pork shoulder for patties. Marinate both with fish sauce, sugar, shallots.
vi: Thịt ba rọi thái miếng. Thịt nạc vai băm nhuyễn làm chả viên. Ướp cả hai loại thịt với nước mắm, đường, hành tím.

# r4_step_2
source: Make dipping sauce: fish sauce, sugar, vinegar (or lime), garlic, chili to taste.
vi: Pha nước chấm: nước mắm, đường, giấm (hoặc chanh), tỏi, ớt theo tỉ lệ vừa ăn.

# r4_step_3
source: Make pickles: thinly slice kohlrabi, carrot, papaya, soak in sugar and vinegar.
vi: Làm dưa góp: thái mỏng su hào, cà rốt, đu đủ, ngâm giấm đường.

# r4_step_4
source: Grill pork belly and patties over charcoal until fragrant and golden.
vi: Nướng thịt và chả viên trên than hoa cho đến khi vàng thơm.

# r4_step_5
source: Put grilled pork into the warm dipping sauce bowl, add pickles.
vi: Cho chả, thịt nướng vào bát nước chấm nóng, thêm dưa góp.

# r4_step_6
source: Serve with vermicelli and fresh herbs.
vi: Ăn kèm bún và rau sống.

# r5_name
source: Fried Chicken Wings
vi: Cánh gà rán

# r5_ing_1
source: Chicken wings (1kg)
vi: Cánh gà (1kg)

# r5_ing_2
source: Crispy fry flour (150g)
vi: Bột chiên giòn (150g)

# r5_ing_3
source: Egg (1)
vi: Trứng (1 quả)

# r5_ing_4
source: Unsweetened milk (50ml)
vi: Sữa tươi không đường (50ml)

# r5_ing_5
source: Spices: garlic powder, onion powder, paprika, salt, pepper
vi: Gia vị: tỏi bột, hành bột, ớt bột paprika, muối, tiêu

# r5_step_1
source: Clean chicken wings, pat dry. Marinate with salt, pepper, garlic, onion, and paprika powder for 30 minutes.
vi: Rửa sạch cánh gà, để ráo. Ướp gà với muối, tiêu, tỏi bột, hành bột, ớt bột trong 30 phút.

# r5_step_2
source: Make wet batter: mix egg and milk.
vi: Pha bột ướt: trộn trứng và sữa tươi.

# r5_step_3
source: Make dry batter: mix crispy flour with a little salt and paprika.
vi: Pha bột khô: trộn bột chiên giòn với chút muối và ớt bột.

# r5_step_4
source: Dip chicken wings in wet batter, then dredge thoroughly in dry batter.
vi: Nhúng gà qua bột ướt, sau đó lăn đều qua bột khô.

# r5_step_5
source: Deep fry in oil at medium heat (170°C) for 10-12 minutes until golden and cooked through.
vi: Chiên ngập dầu ở lửa vừa (170°C) trong 10-12 phút cho đến khi gà chín vàng giòn.

# r5_step_6
source: Drain on a rack and serve.
vi: Vớt ra để ráo dầu và thưởng thức.

# r7_name
source: Yangzhou Fried Rice
vi: Cơm rang Dương Châu

# r7_ing_1
source: Cooked rice (cold) (2 bowls)
vi: Cơm trắng (để nguội) (2 bát)

# r7_ing_2
source: Eggs (2)
vi: Trứng gà (2 quả)

# r7_ing_3
source: Chinese sausage (1)
vi: Lạp xưởng (1 cây)

# r7_ing_4
source: Vietnamese ham (100g)
vi: Chả lụa (100g)

# r7_ing_5
source: Peas, carrots, corn (100g)
vi: Đậu Hà Lan, cà rốt, bắp Mỹ (100g)

# r7_ing_6
source: Shrimp (100g)
vi: Tôm (100g)

# r7_step_1
source: Dice all ingredients (sausage, ham, carrots, shrimp). Parboil peas, corn, and carrots.
vi: Tất cả nguyên liệu (lạp xưởng, chả lụa, cà rốt, tôm) thái hạt lựu. Đậu, bắp, cà rốt luộc sơ.

# r7_step_2
source: Sauté garlic, stir-fry shrimp and sausage until cooked, then add other ingredients and stir well.
vi: Phi tỏi thơm, cho tôm và lạp xưởng vào xào chín, sau đó cho các nguyên liệu khác vào đảo đều.

# r7_step_3
source: Add cold rice to the wok, breaking it up. Add eggs, stirring quickly to coat the rice grains.
vi: Cho cơm nguội vào chảo, đảo tơi. Đập trứng vào, đảo thật nhanh tay để trứng bám đều vào hạt cơm.

# r7_step_4
source: Season with soy sauce, seasoning powder, and add spring onions.
vi: Nêm nếm gia vị (nước tương, hạt nêm), thêm hành lá.

# r7_step_5
source: Stir-fry on high heat until the rice grains are firm and 'dancing'.
vi: Rang ở lửa lớn đến khi hạt cơm săn lại và nhảy lên.

# r8_name
source: Beefsteak
vi: Bò Bít Tết (Beefsteak)

# r8_ing_1
source: Beef tenderloin (200g)
vi: Thịt thăn bò (200g)

# r8_ing_2
source: Potatoes (2)
vi: Khoai tây (2 củ)

# r8_ing_3
source: Egg (1)
vi: Trứng gà (1 quả)

# r8_ing_4
source: Unsalted butter, garlic
vi: Bơ lạt, tỏi

# r8_ing_5
source: Rosemary
vi: Hương thảo (Rosemary)

# r8_ing_6
source: Salt, pepper
vi: Muối, tiêu

# r8_step_1
source: Clean beef, pat dry. Season with salt, pepper, and olive oil.
vi: Rửa sạch thăn bò, thấm khô. Ướp với muối, tiêu và dầu ô liu.

# r8_step_2
source: Make french fries.
vi: Làm khoai tây chiên.

# r8_step_3
source: Heat a cast-iron skillet. Add butter, crushed garlic, and rosemary.
vi: Làm nóng chảo gang. Cho bơ, tỏi đập dập và hương thảo vào.

# r8_step_4
source: Sear the beef, 2-3 minutes per side (for medium-rare). Continuously baste with the garlic butter.
vi: Cho thăn bò vào áp chảo, mỗi mặt 2-3 phút (cho tái vừa - medium rare). Liên tục rưới bơ tỏi lên mặt thịt.

# r8_step_5
source: Make a sunny-side-up egg.
vi: Làm trứng ốp la.

# r8_step_6
source: Serve the steak on a hot plate with fries and egg.
vi: Dọn bít tết ra đĩa nóng, ăn kèm khoai tây và trứng ốp la.

# r9_ing_1
source: Pizza base (1)
vi: Đế pizza (1 cái)

# r9_ing_2
source: Tomato sauce (50ml)
vi: Sốt cà chua (50ml)

# r9_ing_3
source: Mozzarella cheese (100g)
vi: Phô mai Mozzarella (100g)

# r9_ing_4
source: Cherry tomatoes (a few)
vi: Cà chua bi (vài quả)

# r9_ing_5
source: Fresh basil leaves
vi: Lá húng quế tươi (Basil)

# r9_step_1
source: Spread tomato sauce evenly on the pizza base.
vi: Phết đều sốt cà chua lên đế pizza.

# r9_step_2
source: Sprinkle shredded Mozzarella cheese.
vi: Rắc phô mai Mozzarella đã bào sợi.

# r9_step_3
source: Arrange halved cherry tomatoes and basil leaves on top.
vi: Xếp cà chua bi cắt đôi và lá húng quế lên trên.

# r9_step_4
source: Bake at 220°C (430°F) for 10-15 minutes, until the crust is crispy and cheese is golden.
vi: Nướng ở nhiệt độ 220°C trong 10-15 phút, cho đến khi đế giòn và phô mai chảy vàng.

# r9_step_5
source: Drizzle with olive oil before serving.
vi: Rưới thêm chút dầu ô liu khi thưởng thức.

# r10_name
source: Fried Spring Rolls (Nem Ran)
vi: Chả giò (Nem rán)

# r10_ing_1
source: Ground pork shoulder (300g)
vi: Thịt nạc vai xay (300g)

# r10_ing_2
source: Shrimp (100g)
vi: Tôm (100g)

# r10_ing_3
source: Glass noodles, wood ear mushrooms, shiitake mushrooms
vi: Miến dong, mộc nhĩ, nấm hương

# r10_ing_4
source: Carrot, kohlrabi (or bean sprouts)
vi: Cà rốt, su hào (hoặc giá đỗ)

# r10_ing_5
source: Eggs (2)
vi: Trứng (2 quả)

# r10_ing_6
source: Rice paper wrappers
vi: Vỏ bánh đa nem

# r10_ing_7
source: Dipping sauce
vi: Nước mắm chấm

# r10_step_1
source: Soak noodles, mushrooms until soft, then mince.
vi: Ngâm miến, mộc nhĩ, nấm hương cho mềm rồi băm nhỏ.

# r10_step_2
source: Shred carrot, kohlrabi. Mince shrimp.
vi: Bào sợi cà rốt, su hào. Tôm băm nhỏ.

# r10_step_3
source: Mix all ingredients (except wrappers) with ground pork and eggs. Season to taste.
vi: Trộn tất cả nguyên liệu (trừ vỏ bánh đa nem) với thịt xay và trứng. Nêm gia vị vừa ăn.

# r10_step_4
source: Lay out a rice paper wrapper, add filling, and roll tightly.
vi: Trải vỏ bánh đa nem, cho nhân vào và cuộn chặt tay.

# r10_step_5
source: First fry: deep fry in medium heat until cooked.
vi: Chiên ngập dầu lần 1 ở lửa vừa cho nem chín.

# r10_step_6
source: Second fry: fry again in hotter oil just before serving to make them crispy.
vi: Chiên lần 2 ở lửa lớn hơn ngay trước khi ăn để nem giòn rụm.

# r11_name
source: Banh Xeo (Vietnamese Pancake)
vi: Bánh Xèo

# r11_ing_1
source: Banh Xeo flour mix (250g)
vi: Bột bánh xèo (gói pha sẵn) (250g)

# r11_ing_2
source: Coconut milk (100ml)
vi: Nước cốt dừa (100ml)

# r11_ing_3
source: Beer (or soda water) (50ml)
vi: Bia (hoặc nước soda) (50ml)

# r11_ing_4
source: Turmeric powder
vi: Bột nghệ

# r11_ing_5
source: Pork belly (200g)
vi: Thịt ba rọi (200g)

# r11_ing_6
source: Shrimp (200g)
vi: Tôm (200g)

# r11_ing_7
source: Bean sprouts, spring onions
vi: Giá đỗ, hành lá

# r11_ing_8
source: Fresh herbs, dipping sauce
vi: Rau sống, nước mắm chấm

# r11_step_1
source: Mix Banh Xeo flour with coconut milk, beer, turmeric, and chopped spring onions. Let rest for 30 minutes.
vi: Pha bột bánh xèo với nước cốt dừa, bia, bột nghệ và hành lá thái nhỏ. Để bột nghỉ 30 phút.

# r11_step_2
source: Parboil pork belly, slice thinly. Clean shrimp.
vi: Thịt ba rọi luộc sơ, thái mỏng. Tôm làm sạch.

# r11_step_3
source: Heat a pan, add oil. Stir-fry pork and shrimp until cooked.
vi: Làm nóng chảo, cho chút dầu. Cho thịt và tôm vào xào săn.

# r11_step_4
source: Pour a ladle of batter into the pan, tilting to spread thinly. Add bean sprouts.
vi: Đổ một vá bột vào chảo, tráng thật mỏng. Thêm giá đỗ.

# r11_step_5
source: Cover with a lid for about 2 minutes for the pancake and sprouts to cook.
vi: Đậy vung khoảng 2 phút cho bánh chín và giá chín.

# r11_step_6
source: Remove lid, fry until the crust is crispy. Fold the pancake in half.
vi: Mở vung, chiên thêm cho đến khi vỏ bánh giòn. Gập đôi bánh lại.

# r11_step_7
source: Serve with fresh herbs and sweet and sour fish sauce.
vi: Ăn kèm rau sống và nước mắm chua ngọt.

# r13_name
source: Sour Fish Soup (Canh Chua Ca Loc)
vi: Canh chua cá lóc

# r13_ing_1
source: Snakehead fish (1 medium)
vi: Cá lóc (1 con vừa)

# r13_ing_2
source: Taro stem (Bac Ha)
vi: Dọc mùng (bạc hà)

# r13_ing_3
source: Okra, tomatoes, bean sprouts
vi: Đậu bắp, cà chua, giá đỗ

# r13_ing_4
source: Pineapple
vi: Thơm (dứa)

# r13_ing_5
source: Tamarind paste
vi: Me vắt

# r13_ing_6
source: Rice paddy herb, culantro, chili
vi: Ngò om, quế, ớt

# r13_step_1
source: Clean fish, cut into chunks, marinate with spices.
vi: Cá lóc làm sạch, cắt khoanh, ướp gia vị.

# r13_step_2
source: Extract tamarind juice.
vi: Lấy nước cốt me.

# r13_step_3
source: Sauté garlic, stir-fry tomatoes and pineapple.
vi: Phi tỏi thơm, cho cà chua và thơm vào xào sơ.

# r13_step_4
source: Add water, bring to a boil, add tamarind juice.
vi: Đổ nước vào nấu sôi, cho nước cốt me vào.

# r13_step_5
source: When boiling, add fish and cook until done.
vi: Nước sôi, cho cá lóc vào nấu chín.

# r13_step_6
source: Add okra, taro stem, cook for another 3 minutes.
vi: Cho đậu bắp, dọc mùng vào nấu thêm 3 phút.

# r13_step_7
source: Finally, add bean sprouts. Season again to balance sour-salty-sweet flavors.
vi: Cuối cùng cho giá đỗ. Nêm nếm lại cho vừa vị chua-mặn-ngọt.

# r13_step_8
source: Turn off heat, add chopped herbs and chili.
vi: Tắt bếp, cho ngò om, quế cắt nhỏ và ớt.

# r14_name
source: Beef Stew (Bo Kho)
vi: Bò kho

# r14_ing_1
source: Beef shank/flank (500g)
vi: Thịt nạm bò (500g)

# r14_ing_2
source: Carrots (2)
vi: Cà rốt (2 củ)

# r14_ing_3
source: Lemongrass (3 stalks)
vi: Sả (3 cây)

# r14_ing_4
source: Ginger, garlic, shallots
vi: Gừng, tỏi, hành tím

# r14_ing_5
source: Bo Kho seasoning powder (1 packet)
vi: Bột gia vị bò kho (1 gói)

# r14_ing_6
source: Red wine (50ml) (optional)
vi: Rượu vang đỏ (50ml) (tùy chọn)

# r14_ing_7
source: Star anise, cinnamon
vi: Hoa hồi, quế

# r14_step_1
source: Cut beef into cubes. Marinate with minced ginger, garlic, shallots, seasoning powder, sugar, salt, pepper for 30 minutes.
vi: Thịt bò cắt vuông, ướp với gừng, tỏi, hành tím băm, gói gia vị bò kho, chút đường, muối, tiêu trong 30 phút.

# r14_step_2
source: Sauté lemongrass, garlic. Add beef and sear.
vi: Phi thơm sả, tỏi. Cho thịt bò vào xào săn.

# r14_step_3
source: Add red wine (if using), stir well.
vi: Thêm rượu vang đỏ (nếu có), đảo đều.

# r14_step_4
source: Add water to cover beef, add star anise, cinnamon. Simmer on low heat for 1.5 - 2 hours until tender.
vi: Đổ nước ngập mặt thịt, thêm hoa hồi, quế. Hầm ở lửa nhỏ 1.5 - 2 giờ cho thịt mềm.

# r14_step_5
source: Cut carrots into chunks, add to the pot, simmer for another 20 minutes.
vi: Cà rốt cắt miếng, cho vào hầm thêm 20 phút.

# r14_step_6
source: Season to taste. Serve with baguette or noodles.
vi: Nêm nếm lại. Ăn kèm bánh mì hoặc hủ tiếu.

# r15_name
source: Stir-fried Glass Noodles with Crab
vi: Miến xào cua

# r15_ing_1
source: Glass noodles (200g)
vi: Miến dong (200g)

# r15_ing_2
source: Crab meat (100g)
vi: Thịt cua (100g)

# r15_ing_3
source: Shrimp (100g)
vi: Tôm (100g)

# r15_ing_4
source: Wood ear mushrooms, shiitake mushrooms
vi: Mộc nhĩ, nấm hương

# r15_ing_5
source: Carrot, onion, bean sprouts
vi: Cà rốt, hành tây, giá đỗ

# r15_ing_6
source: Egg (1)
vi: Trứng gà (1 quả)

# r15_ing_7
source: Spring onions, cilantro
vi: Hành lá, ngò

# r15_step_1
source: Soak noodles until soft, cut, blanch, rinse with cold water, toss with 1 tbsp oil.
vi: Ngâm miến cho mềm, cắt khúc, trụng sơ nước sôi rồi xả nước lạnh, trộn với 1 muỗng dầu ăn cho tơi.

# r15_step_2
source: Soak mushrooms until soft, julienne. Julienne carrot, onion.
vi: Ngâm mộc nhĩ, nấm hương cho mềm, thái sợi. Cà rốt, hành tây thái sợi.

# r15_step_3
source: Peel shrimp. Sauté garlic, stir-fry shrimp and crab meat, season.
vi: Tôm bóc vỏ. Phi tỏi thơm, xào chín tôm và thịt cua, nêm gia vị.

# r15_step_4
source: Stir-fry vegetables (carrot, onion, mushrooms) until tender-crisp.
vi: Xào rau củ (cà rốt, hành tây, nấm) cho chín tới.

# r15_step_5
source: Add noodles to the wok, stir well. Add egg, stirring quickly to coat the noodles.
vi: Cho miến vào chảo, đảo đều. Đập trứng vào, đảo nhanh tay cho trứng bám vào miến.

# r15_step_6
source: Add shrimp, crab, bean sprouts, spring onions. Stir well, season again and sprinkle pepper.
vi: Cho tôm, cua, giá đỗ, hành lá vào đảo đều. Nêm lại gia vị và rắc tiêu.

# r16_name
source: Calamansi Tea (Tra Tac)
vi: Trà tắc

# r16_ing_1
source: Black tea (or jasmine tea) (2 bags)
vi: Trà đen (hoặc trà lài) (2 gói)

# r16_ing_2
source: Calamansi (10)
vi: Tắc (quất) (10 quả)

# r16_ing_3
source: Sugar (100g)
vi: Đường (100g)

# r16_ing_4
source: Ice cubes
vi: Đá viên

# r16_step_1
source: Steep 2 tea bags in 200ml boiling water. Let cool.
vi: Hãm 2 gói trà với 200ml nước sôi. Để nguội.

# r16_step_2
source: Make simple syrup: 100g sugar with 50ml water, heat until dissolved.
vi: Nấu nước đường: 100g đường với 50ml nước cho tan.

# r16_step_3
source: Juice 8 calamansi. Thinly slice the remaining 2.
vi: Vắt lấy nước cốt 8 quả tắc. 2 quả còn lại cắt lát mỏng.

# r16_step_4
source: Mix tea: Combine tea, simple syrup, and calamansi juice in a shaker, shake well.
vi: Pha trà: Cho nước trà, nước đường, nước cốt tắc vào bình, lắc đều.

# r16_step_5
source: Add ice to a glass, pour tea, garnish with calamansi slices.
vi: Cho đá vào ly, rót trà, thêm vài lát tắc lên trên.

# r17_name
source: Coconut Coffee
vi: Cà phê Cốt dừa

# r17_ing_1
source: Vietnamese Phin coffee (strong) (50ml)
vi: Cà phê phin (pha đậm đặc) (50ml)

# r17_ing_2
source: Coconut cream (thick) (80ml)
vi: Nước cốt dừa (loại đặc) (80ml)

# r17_ing_3
source: Condensed milk (60ml)
vi: Sữa đặc (60ml)

# r17_ing_4
source: Crushed ice (1 glass)
vi: Đá xay (1 ly)

# r17_step_1
source: Brew a strong phin coffee and let it cool.
vi: Pha một phin cà phê đậm đặc và để nguội.

# r17_step_2
source: Add coconut cream, condensed milk, and ice to a blender.
vi: Cho nước cốt dừa, sữa đặc và đá vào máy xay sinh tố.

# r17_step_3
source: Blend on high speed until smooth like snow (about 1-2 minutes).
vi: Xay hỗn hợp ở tốc độ cao cho đến khi mịn như tuyết (khoảng 1-2 phút).

# r17_step_4
source: Pour the coconut mixture into a glass.
vi: Đổ hỗn hợp cốt dừa ra ly.

# r17_step_5
source: Gently pour the cooled coffee on top to create layers.
vi: Rót từ từ cà phê đã pha nguội lên trên để tạo phân tầng.

# r18_name
source: Orange Juice
vi: Nước ép Cam

# r18_ing_1
source: Oranges (3-4)
vi: Cam sành (3-4 quả)

# r18_ing_2
source: Sugar (optional)
vi: Đường (tùy chọn)

# r18_ing_3
source: Ice cubes
vi: Đá viên

# r18_step_1
source: Cut oranges in half.
vi: Bổ đôi quả cam.

# r18_step_2
source: Use a juicer to extract the juice.
vi: Dùng dụng cụ vắt cam để vắt lấy nước.

# r18_step_3
source: Strain through a sieve to remove seeds and large pulp (if desired).
vi: Lọc qua rây để loại bỏ hạt và tép cam to (nếu không thích).

# r18_step_4
source: Add sugar if the oranges are sour, stir to dissolve.
vi: Thêm đường nếu cam chua, khuấy tan.

# r18_step_5
source: Add ice cubes to a glass and pour the orange juice.
vi: Cho đá viên vào ly và rót nước cam vào thưởng thức.

# r19_name
source: Mango Smoothie
vi: Sinh tố Xoài

# r19_ing_1
source: Ripe mango (1)
vi: Xoài chín (1 quả)

# r19_ing_2
source: Fresh milk (100ml)
vi: Sữa tươi (100ml)

# r19_ing_3
source: Condensed milk (2 tbsp)
vi: Sữa đặc (2 muỗng)

# r19_ing_4
source: Ice cubes (1 glass)
vi: Đá viên (1 ly)

# r19_step_1
source: Peel mango, cut into small pieces.
vi: Xoài gọt vỏ, cắt miếng nhỏ.

# r19_step_2
source: Add mango, fresh milk, condensed milk, and ice cubes to a blender.
vi: Cho xoài, sữa tươi, sữa đặc và đá viên vào máy xay sinh tố.

# r19_step_3
source: Blend on high speed until the mixture is smooth.
vi: Xay ở tốc độ cao cho đến khi hỗn hợp mịn.

# r19_step_4
source: Pour into a glass and enjoy.
vi: Rót ra ly và thưởng thức.

# r20_name
source: Bubble Tea (Pearl Milk Tea)
vi: Trà sữa Trân châu

# r20_ing_1
source: Black tea (2 bags)
vi: Trà đen (2 gói)

# r20_ing_2
source: Condensed milk (50ml)
vi: Sữa đặc (50ml)

# r20_ing_3
source: Tapioca starch (100g)
vi: Bột năng (100g)

# r20_ing_4
source: Cocoa powder (10g)
vi: Bột ca cao (10g)

# r20_ing_5
source: Black sugar (50g)
vi: Đường đen (50g)

# r20_ing_6
source: Ice cubes
vi: Đá viên

# r20_step_1
source: Make pearls: Mix tapioca starch, cocoa powder. slowly pour boiling water, knead dough. Roll into small balls. Boil pearls for 15 mins, turn off heat, rest for 15 mins. Remove, soak in ice water, then mix with black sugar.
vi: Làm trân châu: Trộn bột năng, bột ca cao. Đổ nước sôi từ từ vào nhào bột. Vo thành viên nhỏ. Luộc trân châu 15 phút, tắt bếp ủ 15 phút. Vớt ra ngâm nước đá, rồi trộn với đường đen.

# r20_step_2
source: Brew tea: Steep tea in 200ml boiling water. Strain.
vi: Pha trà: Hãm trà với 200ml nước sôi. Lọc bỏ bã.

# r20_step_3
source: Make milk tea: Add condensed milk to hot tea, stir until dissolved.
vi: Pha trà sữa: Cho sữa đặc vào trà nóng, khuấy tan.

# r20_step_4
source: Add pearls to a glass, add ice, pour milk tea and enjoy.
vi: Cho trân châu vào ly, thêm đá, rót trà sữa vào và thưởng thức.
